In [14]:
import pandas as pd
import datetime as dt
import numpy as np

In [15]:
path = 'C:/Users/jakec/Documents/DataAnalyticsBootCamp/Project/Big-Five-Stocks/Resources/'

raw_stock_data = pd.read_csv(f'{path}big_five_stocks.csv')

raw_company_data = pd.read_csv(f'{path}company_data.csv',encoding='iso-8859-1')

In [16]:
raw_stock_data.columns = ['date','name','open','close','high','low','volume']
# or could do the following:
#raw_data.rename(columns={'Unnamed: 0':'date'},inplace=TRUE)

In [17]:
raw_stock_data['date'] = pd.to_datetime(raw_stock_data['date'])

raw_company_data['founded'] = pd.to_datetime(raw_company_data['founded'])

In [18]:
companies = raw_company_data
companies = companies.reset_index()
companies['company'] = companies['index']
companies = companies.drop(labels=['company_name','index'],axis=1)

In [19]:
raw_stock_data['year'] = pd.DatetimeIndex(raw_stock_data['date']).year

In [20]:
raw_stock_data = raw_stock_data.set_index('date')

raw_company_data = raw_company_data.set_index('index')

In [21]:
#start_date = '1/1/2015'
stonks = raw_stock_data.loc['2015-01-01':'2019-08-23']

In [22]:
stonks = stonks.reset_index()

In [23]:
#stonks.insert(loc=0,column='index',value=np.arange(len(stonks)))

In [24]:
stonks.isnull().values.any()

False

In [25]:
amzn = stonks.loc[stonks['name']=='AMZN',]
#amzn = amzn.drop(labels=['name','index'],axis=1)
amzn = amzn.drop(labels=['name'],axis=1)

fb = stonks.loc[stonks['name']=='FB',]
#fb = fb.drop(labels=['name','index'],axis=1)
fb = fb.drop(labels=['name'],axis=1)

ixic = stonks.loc[stonks['name']=='^IXIC',]
#ixic = ixic.drop(labels=['name','index'],axis=1)
ixic = ixic.drop(labels=['name'],axis=1)

googl = stonks.loc[stonks['name']=='GOOGL',]
#googl = googl.drop(labels=['name','index'],axis=1)
googl = googl.drop(labels=['name'],axis=1)

msft = stonks.loc[stonks['name']=='MSFT',]
#msft = msft.drop(labels=['name','index'],axis=1)
msft = msft.drop(labels=['name'],axis=1)

aapl = stonks.loc[stonks['name']=='AAPL',]
#aapl = aapl.drop(labels=['name','index'],axis=1)
aapl = aapl.drop(labels=['name'],axis=1)

year15 = stonks.loc[stonks['year']==2015,]
year15 = year15.drop(labels='year',axis=1)

year16 = stonks.loc[stonks['year']==2016,]
#year16 = year16.drop(labels=['year','index'],axis=1)
year16 = year16.drop(labels=['year'],axis=1)
#year16.insert(loc=0,column='index',value=np.arange(len(year16)))

year17 = stonks.loc[stonks['year']==2017,]
#year17 = year17.drop(labels=['year','index'],axis=1)
year17 = year17.drop(labels=['year'],axis=1)
#year17.insert(loc=0,column='index',value=np.arange(len(year17)))

year18 = stonks.loc[stonks['year']==2018,]
year18 = year18.drop(labels=['year'],axis=1)
#year18.insert(loc=0,column='index',value=np.arange(len(year18)))

year19 = stonks.loc[stonks['year']==2019,]
year19 = year19.drop(labels=['year'],axis=1)
#year19.insert(loc=0,column='index',value=np.arange(len(year19)))

In [26]:
stonks['name_date'] = stonks['name'].astype(str) + stonks['date'].astype(str)
year15['name_date'] = year15['name'].astype(str) + year15['date'].astype(str)
year16['name_date'] = year16['name'].astype(str) + year16['date'].astype(str)
year17['name_date'] = year17['name'].astype(str) + year17['date'].astype(str)
year18['name_date'] = year18['name'].astype(str) + year18['date'].astype(str)
year19['name_date'] = year19['name'].astype(str) + year19['date'].astype(str)

In [27]:
stonks.head()

,date,name,open,close,high,low,volume,year,name_date
0,2015-01-02,AMZN,312.50,308.52,314.75,306.96,2788101,2015,AMZN2015-01-02
1,2015-01-02,FB,78.58,78.45,78.93,77.70,18177475,2015,FB2015-01-02
2,2015-01-02,^IXIC,4760.24,4726.81,4777.01,4698.11,0,2015,^IXIC2015-01-02
3,2015-01-02,GOOGL,532.60,529.55,535.80,527.88,1327870,2015,GOOGL2015-01-02
4,2015-01-02,MSFT,46.66,46.76,47.42,46.54,27913852,2015,MSFT2015-01-02

In [28]:
amzn.head()

         date    open   close    high     low   volume  year
0  2015-01-02  312.50  308.52  314.75  306.96  2788101  2015
9  2015-01-05  307.02  302.19  308.38  300.85  2774231  2015
15 2015-01-06  302.20  295.29  303.00  292.38  3519034  2015
21 2015-01-07  297.54  298.42  301.28  295.33  2640349  2015
26 2015-01-08  300.59  300.46  303.14  296.11  3088398  2015

In [29]:
year15.head()

,date,name,open,close,high,low,volume,name_date
0,2015-01-02,AMZN,312.50,308.52,314.75,306.96,2788101,AMZN2015-01-02
1,2015-01-02,FB,78.58,78.45,78.93,77.70,18177475,FB2015-01-02
2,2015-01-02,^IXIC,4760.24,4726.81,4777.01,4698.11,0,^IXIC2015-01-02
3,2015-01-02,GOOGL,532.60,529.55,535.80,527.88,1327870,GOOGL2015-01-02
4,2015-01-02,MSFT,46.66,46.76,47.42,46.54,27913852,MSFT2015-01-02

In [30]:
year16.head()

           date   name     open    close     high      low    volume name_date
1512 2016-01-04   AAPL   102.61   105.35   105.37   102.00  67649387       NaN
1513 2016-01-04   MSFT    54.32    54.80    54.80    53.39  53777963       NaN
1514 2016-01-04   AMZN   656.29   636.99   657.72   627.51   9314519       NaN
1515 2016-01-04  GOOGL   762.20   759.44   762.20   747.54   3369068       NaN
1516 2016-01-04  ^IXIC  4897.65  4903.09  4903.09  4846.98         0       NaN

In [31]:
# Create the aggregate dataframe
agg_stonks = stonks.groupby(['name','year']).agg({'open':'mean','close':'mean','high':'mean','low':'mean','volume':'sum'})
#agg_stonks
agg_stonks = agg_stonks.reset_index()
agg_stonks['name_year'] = agg_stonks['name'].astype(str) + agg_stonks['year'].astype(str)
#agg_stonks = agg_stonks.drop(labels=['name','year'],axis=1)

In [32]:
agg_stonks[['open','close','high','low']] = agg_stonks[['open','close','high','low']].round(decimals=2)

In [33]:
agg_stonks.columns = ['name','year','avg_open','avg_close','avg_high','avg_low','total_volume','name_year']

In [34]:
agg_stonks.head()

   name  year  avg_open  avg_close  avg_high  avg_low  total_volume name_year
0  AAPL  2015    120.17     120.04    121.24   118.86   13068421452  AAPL2015
1  AAPL  2016    104.51     104.60    105.43   103.69    9666725519  AAPL2016
2  AAPL  2017    150.45     150.55    151.41   149.49    6811557331  AAPL2017
3  AAPL  2018    189.11     189.05    191.00   187.19    8523558839  AAPL2018
4  AAPL  2019    187.56     187.84    189.52   186.03    4759795987  AAPL2019

In [35]:
# Import SQL Alchemy
from sqlalchemy import create_engine
# Import and establish Base for which classes will be constructed 
from sqlalchemy.ext.declarative import declarative_base
# Import modules to declare columns and column data types
from sqlalchemy import Column, Integer, String, Float# Import SQL Alchemy
from sqlalchemy import create_engine
# Import and establish Base for which classes will be constructed 
from sqlalchemy.ext.declarative import declarative_base
# Import modules to declare columns and column data types
from sqlalchemy import Column, Integer, String, Float

In [36]:
Base = declarative_base()

In [37]:
## We've got our dataframes, now let's create our classes

class Stonks(Base):
    __tablename__ = 'stonks'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    year = Column(String(4))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Amzn(Base):
    __tablename__ = 'amazn'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Fb(Base):
    __tablename__ = 'fb'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Aapl(Base):
    __tablename__ = 'aapl'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Ixic(Base):
    __tablename__ = 'ixic'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Googl(Base):
    __tablename__ = 'googl'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Msft(Base):
    __tablename__ = 'msft'
    date = Column(String(10),primary_key=True,unique=True)
    year = Column(String(4))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Year15(Base):
    __tablename__ = 'year15'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Year16(Base):
    __tablename__ = 'year16'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Year17(Base):
    __tablename__ = 'year17'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Year18(Base):
    __tablename__ = 'year18'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Year19(Base):
    __tablename__ = 'year19'
    name_date = Column(String(20),primary_key=True,unique=True)
    date = Column(String(10))
    name = Column(String(6))
    open = Column(Integer)
    close = Column(Integer)
    high = Column(Integer)
    low = Column(Integer)
    volume = Column(Integer)
class Companies(Base):
    __tablename__ = 'companies'
    company = Column(String(10),primary_key=True,unique=True)
    ticker_symbol = Column(String(6))
    founded = Column(String(15))
    headquarters = Column(String(50))
    revenue_2019 = Column(Integer)
    operating_income_2019 = Column(Integer)
    net_income_2019 = Column(Integer)
    total_assets_2019 = Column(Integer)
    total_equity_2019 = Column(Integer)
    num_employees = Column(Integer)
class Agg_stonks(Base):
    __tablename__ = 'agg_stonks'
    name_year = Column(String(15),primary_key=True,unique=True)
    name = Column(String(6))
    year = Column(String(4))
    avg_open = Column(Integer)
    avg_close = Column(Integer)
    avg_high = Column(Integer)
    avg_low = Column(Integer)
    total_volume = Column(Integer)

In [38]:
engine = create_engine("sqlite:///stonks.sqlite")
conn = engine.connect()

In [39]:
Base.metadata.create_all(conn)

In [40]:
data = engine.execute("SELECT * FROM stonks LIMIT 10")
for data in data:
    print(data)

In [41]:
from sqlalchemy.orm import Session
session = Session(bind=engine)

In [42]:
stonks.to_sql("stonks",engine,if_exists='replace')
agg_stonks.to_sql("agg_stonks",engine,if_exists='replace')
amzn.to_sql("amazn",engine,if_exists='replace')
fb.to_sql("fb",engine,if_exists='replace')
aapl.to_sql("aapl",engine,if_exists='replace')
ixic.to_sql("ixic",engine,if_exists='replace')
googl.to_sql("googl",engine,if_exists='replace')
msft.to_sql("msft",engine,if_exists='replace')
year15.to_sql("year15",engine,if_exists='replace')
year16.to_sql("year16",engine,if_exists='replace')
year17.to_sql("year17",engine,if_exists='replace')
year18.to_sql("year18",engine,if_exists='replace')
year19.to_sql("year19",engine,if_exists='replace')
companies.to_sql("companies",engine,if_exists='replace')

In [43]:
Base.metadata.tables

immutabledict({'stonks': Table('stonks', MetaData(bind=None), Column('name_date', String(length=20), table=<stonks>, primary_key=True, nullable=False), Column('date', String(length=10), table=<stonks>), Column('year', String(length=4), table=<stonks>), Column('name', String(length=6), table=<stonks>), Column('open', Integer(), table=<stonks>), Column('close', Integer(), table=<stonks>), Column('high', Integer(), table=<stonks>), Column('low', Integer(), table=<stonks>), Column('volume', Integer(), table=<stonks>), schema=None), 'amazn': Table('amazn', MetaData(bind=None), Column('date', String(length=10), table=<amazn>, primary_key=True, nullable=False), Column('year', String(length=4), table=<amazn>), Column('open', Integer(), table=<amazn>), Column('close', Integer(), table=<amazn>), Column('high', Integer(), table=<amazn>), Column('low', Integer(), table=<amazn>), Column('volume', Integer(), table=<amazn>), schema=None), 'fb': Table('fb', MetaData(bind=None), Column('date', String(length=10), table=<fb>, primary_key=True, nullable=False), Column('year', String(length=4), table=<fb>), Column('open', Integer(), table=<fb>), Column('close', Integer(), table=<fb>), Column('high', Integer(), table=<fb>), Column('low', Integer(), table=<fb>), Column('volume', Integer(), table=<fb>), schema=None), 'aapl': Table('aapl', MetaData(bind=None), Column('date', String(length=10), table=<aapl>, primary_key=True, nullable=False), Column('year', String(length=4), table=<aapl>), Column('open', Integer(), table=<aapl>), Column('close', Integer(), table=<aapl>), Column('high', Integer(), table=<aapl>), Column('low', Integer(), table=<aapl>), Column('volume', Integer(), table=<aapl>), schema=None), 'ixic': Table('ixic', MetaData(bind=None), Column('date', String(length=10), table=<ixic>, primary_key=True, nullable=False), Column('year', String(length=4), table=<ixic>), Column('open', Integer(), table=<ixic>), Column('close', Integer(), table=<ixic>), Column('high', Integer(), table=<ixic>), Column('low', Integer(), table=<ixic>), Column('volume', Integer(), table=<ixic>), schema=None), 'googl': Table('googl', MetaData(bind=None), Column('date', String(length=10), table=<googl>, primary_key=True, nullable=False), Column('year', String(length=4), table=<googl>), Column('open', Integer(), table=<googl>), Column('close', Integer(), table=<googl>), Column('high', Integer(), table=<googl>), Column('low', Integer(), table=<googl>), Column('volume', Integer(), table=<googl>), schema=None), 'msft': Table('msft', MetaData(bind=None), Column('date', String(length=10), table=<msft>, primary_key=True, nullable=False), Column('year', String(length=4), table=<msft>), Column('open', Integer(), table=<msft>), Column('close', Integer(), table=<msft>), Column('high', Integer(), table=<msft>), Column('low', Integer(), table=<msft>), Column('volume', Integer(), table=<msft>), schema=None), 'year15': Table('year15', MetaData(bind=None), Column('name_date', String(length=20), table=<year15>, primary_key=True, nullable=False), Column('date', String(length=10), table=<year15>), Column('name', String(length=6), table=<year15>), Column('open', Integer(), table=<year15>), Column('close', Integer(), table=<year15>), Column('high', Integer(), table=<year15>), Column('low', Integer(), table=<year15>), Column('volume', Integer(), table=<year15>), schema=None), 'year16': Table('year16', MetaData(bind=None), Column('name_date', String(length=20), table=<year16>, primary_key=True, nullable=False), Column('date', String(length=10), table=<year16>), Column('name', String(length=6), table=<year16>), Column('open', Integer(), table=<year16>), Column('close', Integer(), table=<year16>), Column('high', Integer(), table=<year16>), Column('low', Integer(), table=<year16>), Column('volume', Integer(), table=<year16>), schema=None), 'year17': Table('year17', MetaData(bind=None), Column('name_date', String(length=20), table=<year17>, primary_key=True, nullable=False), Column('date', String(length=10), table=<year17>), Column('name', String(length=6), table=<year17>), Column('open', Integer(), table=<year17>), Column('close', Integer(), table=<year17>), Column('high', Integer(), table=<year17>), Column('low', Integer(), table=<year17>), Column('volume', Integer(), table=<year17>), schema=None), 'year18': Table('year18', MetaData(bind=None), Column('name_date', String(length=20), table=<year18>, primary_key=True, nullable=False), Column('date', String(length=10), table=<year18>), Column('name', String(length=6), table=<year18>), Column('open', Integer(), table=<year18>), Column('close', Integer(), table=<year18>), Column('high', Integer(), table=<year18>), Column('low', Integer(), table=<year18>), Column('volume', Integer(), table=<year18>), schema=None), 'year19': Table('year19', MetaData(bind=None), Column('name_date', String(length=20), table=<year19>, primary_key=True, nullable=False), Column('date', String(length=10), table=<year19>), Column('name', String(length=6), table=<year19>), Column('open', Integer(), table=<year19>), Column('close', Integer(), table=<year19>), Column('high', Integer(), table=<year19>), Column('low', Integer(), table=<year19>), Column('volume', Integer(), table=<year19>), schema=None), 'companies': Table('companies', MetaData(bind=None), Column('company', String(length=10), table=<companies>, primary_key=True, nullable=False), Column('ticker_symbol', String(length=6), table=<companies>), Column('founded', String(length=15), table=<companies>), Column('headquarters', String(length=50), table=<companies>), Column('revenue_2019', Integer(), table=<companies>), Column('operating_income_2019', Integer(), table=<companies>), Column('net_income_2019', Integer(), table=<companies>), Column('total_assets_2019', Integer(), table=<companies>), Column('total_equity_2019', Integer(), table=<companies>), Column('num_employees', Integer(), table=<companies>), schema=None), 'agg_stonks': Table('agg_stonks', MetaData(bind=None), Column('name_year', String(length=15), table=<agg_stonks>, primary_key=True, nullable=False), Column('name', String(length=6), table=<agg_stonks>), Column('year', String(length=4), table=<agg_stonks>), Column('avg_open', Integer(), table=<agg_stonks>), Column('avg_close', Integer(), table=<agg_stonks>), Column('avg_high', Integer(), table=<agg_stonks>), Column('avg_low', Integer(), table=<agg_stonks>), Column('total_volume', Integer(), table=<agg_stonks>), schema=None)})

In [ ]:
data = engine.execute("SELECT * FROM companies")
for data in data:
    print(data)

In [ ]:
data = engine.execute("SELECT * FROM stonks LIMIT 10")
for data in data:
    print(data)